english/line.md

# Table of Contents

-   [语义](#org568b0f8)
-   [短语](#org91dda3c)

各种线


<a id="org568b0f8"></a>

# 语义


## 线

Draw a straight line across the top of the page.


## 边界线

He was born in a small town just across the state line.


## 排

There was a line of fir trees on either side of the road.


## 队

I looked in despair at the long line in front of the ticket office.


## 路线

Light travels in a straight line.


## 皱纹

There were fine lines around her eyes.


## 电话线

I'm sorry, the line is busy.


## 铁道

We were delayed because of a problem further along the line.


## 分界线

There is a fine line between superstition and religion.


## 线条

She was wearing a loose dress which softened the lines of her body.


## 字行

Scroll down to line 29.


## 态度

I can't agree with the government's line on immigration.


## 方式

It seemed useless to pursue this line of questioning.


## 防线

They finally broke through the German line.


## 各级人员

Decisions are taken by senior officers and fed down through the line of command to the ordinary soldiers.


## 绳子

She hung the clothes out on the washing line.


## 种类

The company has just launched a new line of small, low-priced computers.


## 罚抄写

He got 50 lines for being cheeky to a teacher.


## 世系

She comes from a long line of actors.


## 行业

What line of business is he in?


## 运输公司

He runs a transatlatic shipping line.


## 给&#x2026;加衬里

Are those curtains lined?


## 铺

The birds use small leaves for lining their nests.


## 排成行

Crowds lined the route to the palace.


<a id="org91dda3c"></a>

# 短语


## on the line

Henry is on the line from New York.

<https://youglish.com/getbyid/6768586/on%20the%20line/english>


## got on the line to

I got on the line to the hospital as soon as I heard about the accident.


## chat-up lines

This was one of his favourite chat-up lines.

<https://youglish.com/getbyid/106755609/chat%20up%20lines/english>


## take a tough line on something

The school takes a very tough line on drugs.

<https://youglish.com/getbyid/44873992/take%20a%20tough%20line%20on/english>


## along these lines

They're trying to organize a trip to the beach or something along those lines.

<https://youglish.com/getbyid/19777545/along%20these%20lines/english>


## on line

You can book tickets on line.

<https://youglish.com/getbyid/25926372/on%20line/english>


## drop somebody a line

Drop me a line and let me know how you're getting on.

<https://youglish.com/getbyid/76922731/drop%20me%20a%20line/english>


## don't give me that line

I know for a fact you weren't sick yesterday, so don't give me that line.


## fall into line

Now that France and Germany have signed up, other countries will soon fall into line.

<https://youglish.com/getbyid/80157899/fall%20into%20line/english>


## in line with

**Pensions** will be increased in line with **inflation**.

<https://youglish.com/getbyid/93751640/in%20line%20with/english>


## be out of line

You just keep quiet! You're way out of line.

<https://youglish.com/getbyid/106666265/be%20out%20of%20line/english>


## be in line for

I should be in line for promotion soon.

<https://youglish.com/getbyid/76562059/be%20in%20line%20for/english>


## be on the line

From now on, all our jobs are on the line.

<https://youglish.com/getbyid/6768586/on%20the%20line/english>


## be in somebody's line

Acting's not really in my line, I'm afraid.

<https://youglish.com/getbyid/3045930/be%20in%20my%20line/english>


## get a line on somebody

We need to get some kind of a line on these guys.

<https://youglish.com/getbyid/35711135/get%20a%20line%20on/english>


## somewhere along the line

Somewhere along the line, Errol seemed to have lost interest in her.

<https://youglish.com/getbyid/69446040/somewhere%20along%20the%20line/english>


## down the line

There may be more costs further down the line,

<https://youglish.com/getbyid/15180986/down%20the%20line/english>


## line up

The windows should be lined up with the door frame.

<https://youglish.com/getbyid/165681614/line%20up/english>
